@php
    use App\Http\Libs\Helper;
@endphp

@php
    $girls_list = [
        '1' => [
            'name'          => 'Жанна',
            'age'           => '30',
            'bust_size'     => '3',
            'height'        => '170',
            'weight'        => '56',
            'folder'        => 'zhanna',
            'main_photo'    => '1.png',
            'info'          => '
                <p>Погрузитесь в мир ярких ощущений и наслаждения с эксклюзивной услугой, предоставляемой знойной Жанной в мужском клубе «Рандеву». Её нежные и чуткие руки, словно созданы для искусства соблазнения и раскрепощения души.</p>
                <p>Каждое прикосновение Жанны – это волшебство, которое пробуждает скрытые чувства и эмоции, заставляя сердце биться чаще. Неистовый танец её пальцев по вашему телу подарит вам чувственную гармонию и завораживающее наслаждение.</p>
                <p>Она предлагает вам погрузиться в океан страсти и удовольствия, который скрыт в самых глубинах вашего существа. В её искусных руках вы почувствуете, как напряжение уходит, а волнение нарастает. Каждый момент с Жанной – это волшебное путешествие к высшим точкам блаженства.</p>
                <p>Жанна обладает не только техникой, но и уникальной способностью почувствовать вашу энергию и желания. Она создаст атмосферу, в которой вы сможете открыться и полностью расслабиться, доверившись её заботливым рукам.</p>
                <p>Встречайте рассвет в объятиях Жанны и дарите себе незабываемые моменты блаженства и эмоций. Её эротический массаж – это искусство, которое пробуждает чувства и оставит неизгладимые впечатления.</p>
                <p>Погрузитесь в уникальный опыт, который навсегда останется в вашей памяти. Жанна приглашает вас на незабываемое путешествие к себе – к истинной страсти и возбуждению. Доверьтесь её мастерству, и вы обретете внутреннюю гармонию и расслабление, которые станут надежным убежищем в суете повседневности.</p>
                <p>Откройте для себя новые грани наслаждения с Жанной в мужском клубе «Рандеву». Её интимный массаж – это прикосновение к душе, которое зажжет огонь страсти в ваших глазах и оставит незабываемый след в вашем сердце. Восхитительные ощущения и волнующие моменты ждут вас – просто раскройтесь для этого чуда!</p>
            '
        ],
        '2' => [
            'name'          => 'Ульяна',
            'age'           => '25',
            'bust_size'     => '2',
            'height'        => '175',
            'weight'        => '55',
            'folder'        => 'ulyana',
            'main_photo'    => '9.png',
            'info'          => '
                <p>Ульяна – искусная мастерица по мужскому эротическому массажу и релаксации из салона «Рандеву». Её нежные руки и заботливое отношение позволяют каждому клиенту почувствовать настоящий уют и комфорт с первых минут сеанса.</p>
                <p>Ульяна обладает уникальным даром создавать атмосферу полного расслабления, в которой заботы и напряжение будто тают, а умиротворение и гармония наполняют всё сущее. Она обладает вниманием к деталям и отзывчивостью к пожеланиям каждого гостя, делая массаж настоящим индивидуальным творением и путешествием в мир внутреннего спокойствия.</p>
                <p>Её мастерство простирается от традиционных методик до уникальных и эффективных техник релаксации. Каждое движение её рук направлено на обеспечение исключительного комфорта и удовольствия для клиента. Ульяна знает, как раскрыть потенциал эротического массажа, придавая ему тонкую нотку соблазна и страсти.</p>
                <p>Её обаяние и доброжелательность позволяют создать особую связь с клиентами, которые часто возвращаются к ней снова и снова, чтобы погрузиться в мир её профессионального таланта и теплого отношения.</p>
                <p>Если вы ищете мастера, способного подарить вам настоящее удовольствие, расслабление и эмоциональное возбуждение, то Ульяна из салона «Рандеву» – идеальный выбор. Откройте для себя неповторимый опыт массажа под её заботливым ведением, и вы познаете настоящую гармонию тела и духа.</p>
            '
        ],
        '3' => [
            'name'          => 'Натали',
            'age'           => '32',
            'bust_size'     => '1',
            'height'        => '165',
            'weight'        => '50',
            'folder'        => 'natalie',
            'main_photo'    => '9.png',
            'info'          => '
                <p>Окутанный мистическим очарованием мужской клуб «Рандеву» приглашает вас на невероятное путешествие по миру чувств и наслаждений с прекрасной Натали. Её эротический массаж — это эмоциональный сплав страсти, нежности и особенной интимной гармонии, которую сложно описать словами.</p>
                <p>На пороге уютных апартаментов вы почувствуете, как волнение охватывает ваше тело. Чувственные ароматы и мягкие звуки создадут атмосферу искушения и релаксации, готовя вас к удивительному опыту, который не забудется никогда.</p>
                <p>Натали — истинная мастерица своего дела, которая смогла совершенствовать искусство прикосновения до невероятных высот. Она откроет для вас дверь в мир самых сокровенных желаний и дарит возможность ощутить весь спектр чувственных вибраций.</p>
                <p>Её ласковые руки будто танцуют на вашем теле, воссоздавая симфонию страсти и удовольствия. Она слышит ваше дыхание, ощущает каждое телесное напряжение и точно знает, как раскрыть все ваши по.</p>
                <p>Каждое прикосновение Натали — это неповторимая техника удовольствия, в которой каждая нота звучит страстно и завораживающе. Ваши тела станут одним целым, а время остановится, погружая вас в эйфорию наслаждения.</p>
                <p>Доверьтесь этому танцу страсти, подарите себе возможность полностью расслабиться и отдаться волшебному миру чувств и наслаждения. В объятиях Натали вы обретете внутреннюю гармонию и ощутите, как каждая клеточка вашего тела пробуждается к жизни.</p>
                <p>Её интимный массаж — это магия, пронизанная нежностью и страстью, которая перевернет ваш мир с ног на голову. Откройте для себя новые грани наслаждения и возбуждения, проникнитесь тайной её мастер.</p>
                <p>Приглашаем вас окунуться в мир изысканных наслаждений и чувственных открытий с Натали в мужском клубе «Рандеву». </p>
            '
        ],
    ];
@endphp

<!-- Массажистки -->
<section class="section-padding women">
    <div class="section-wrapper">
        <div class="section-wrapper__head">Более двадцати молодых и горячих мастериц</div>
    </div>
    
    <div class="women-slider__wrapper">
        <div class="women-slider" data-slider_girl>
            @foreach($girls_list as $k => $v)
                @php $photos = Helper::getPhotosGirl($v['folder']) @endphp
            
                <div class="women-slider__one" data-open_modal="girl_{{ $v['folder'] }}" data-open_modal_slider>
                    <img src="{{ asset('images/girls/'.$v['folder'].'/preview/'.$v['main_photo']) }}">
                    
                    <div class="women-slider__name">{{ $v['name'] }}</div>
                    
                    <div class="women-slider__photo">
                        <span>{{ count($photos) }}</span> <svg><use xlink:href="#site-photo"></use></svg>
                    </div>
                    
                    <div class="women-slider__info">
                        <div class="women-slider__info__one">
                            <t>Возраст:</t> <t>{{ $v['age'] }}</t>
                            <t>Размер груди:</t> <t>{{ $v['bust_size'] }}</t>
                            <t>Рост:</t> <t>{{ $v['height'] }}</t>
                            <t>Вес:</t> <t>{{ $v['weight'] }}</t>
                        </div>
                    </div>
                </div>
            @endforeach
        </div>
        
        <div class="women-slider__wrapper__arrow">
            <div class="women-slider__wrapper__arrow__one left"><svg><use xlink:href="#site-right"></use></svg></div>
            <div class="women-slider__wrapper__arrow__one right"><svg><use xlink:href="#site-right"></use></svg></div>
        </div>
    </div>
</section>

<!-- Модальное окно -->
@include('components/modal/masseuses')